import random

class Random_Menu():
    Menu = [
        "불고기", "찜닭", "닭볶음탕", "치킨", "수육", "아귀찜", "낙지볶음",
        "된장찌개", "감치찌개", "부대찌개", "순두부찌개", "청국장", "동태찌개", "아무찌개",
        "카레", "비빔밥", "오므라이스", "김치볶음밥", "제육덮밥", "치킨마요덮밥", 
        "순대국", "콩나물국밥", "뼈해장국", "우거지국",
        "초밥", "짜장면", "짬봉", "깐풍기", "마파두부", "잡채", "마라탕", "쌀국수", "햄버거",
        "샌드위치", "프렌치토스트", "떡볶이", "시리얼", "샐러드", "밥버거", "핫도그", "편의점도시락", "김밥",
        "육개장", "시레깃국", "갈비탕", "추어탕"
    ]
    result = ""

    def __init__(self, M=None):
        self.M = M
    
    def select(self):
        temp = random.randrange(47)
        self.result = self.Menu[temp]
        return self.result
